# Univariate Analysis

### 5 number summary

1. Minimum
2. Quartile 1(Q1)
3. Quartile 2(Q2) = Median
4. Quartile 3(Q3)
5. Maximum

In [3]:
import numpy as np
import pandas as pd

In [4]:
# read file

df = pd.read_excel('Online_Store_customer_data.xlsx')
df.head(4)

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Amount_spent
0,2019-01-01,151200,Female,19,Single,Kansas,Basic,Unemployment,Other,2051.36
1,2019-01-01,151201,Male,49,Single,Illinois,Basic,self-employed,Card,544.04
2,2019-01-01,151202,Male,63,Married,New Mexico,Basic,workers,PayPal,1572.60
3,2019-01-01,151203,Female,18,Single,Virginia,Platinum,workers,Card,1199.79

In [5]:
# Calculate Minimum
min = df['Age'].min()

# Calculate Q1
q1 = df['Age'].quantile(0.25)

#Calculate Q2
q2= df['Age'].quantile(0.50)

# Calculate Q3
q3 = df['Age'].quantile(0.75)

#Calculate Maximum
max= df['Age'].max()

print(f" Minimum of Age : {min}")
print(f" Quarile 1 of Age : {q1}")
print(f" Quarile 2 of Age or median of age : {q2}")
print(f" Quarile 3 of Age : {q3}")
print(f" Maximum of Age : {max}")

 Minimum of Age : 15
 Quarile 1 of Age : 33.0
 Quarile 2 of Age or median of age : 46.0
 Quarile 3 of Age : 59.0
 Maximum of Age : 77

In [6]:
# Calculate Median
median = df['Age'].median()
print(f" Median of Age : {median}")

 Median of Age : 46.0

In [7]:
df.describe()

       Transaction_ID         Age  Amount_spent
count      150.000000  150.000000    150.000000
mean    151367.573333   45.920000   1544.820933
std        125.167289   17.221619    866.790063
min     151200.000000   15.000000     15.370000
25%     151284.250000   33.000000    807.395000
50%     151332.500000   46.000000   1591.365000
75%     151476.750000   59.000000   2413.275000
max     151585.000000   77.000000   2999.980000

In [8]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Transaction_ID,150.0,151367.573333,125.167289,151200.00,151284.250,151332.500,151476.750,151585.00
Age,150.0,45.920000,17.221619,15.00,33.000,46.000,59.000,77.00
Amount_spent,150.0,1544.820933,866.790063,15.37,807.395,1591.365,2413.275,2999.98

In [9]:
df.describe(include=object).T

                 count unique        top freq
Gender             150      2     Female   86
Marital_status     150      2    Married   97
State_names        150     47   Colorado    7
Segment            150      4      Basic   76
Employees_status   150      4  Employees   52
Payment_method     150      3     PayPal   66

# Sum and Count

In [10]:
#Calculate Total Amount spent
sum= df['Amount_spent'].sum()
sum

231723.14

In [11]:
#Calculate Total Amount spent
count= df['Amount_spent'].count()
count

150